//计算
#include<iostream>
#include<cstdio>
using namespace std;
int main(){
	/*
	printf("格式字符串",对应值1,对应值2, ...);
	1、格式字符串%表示需要顺序使用后面的对应值进行替换
	2、%d:整数 %lld:长整数 %f:浮点数（小数，默认6位小数)
	*/
	printf("1+1=%d\n",1+1);
	printf("1+2+...+100=%d\n", (1+100)*100/2);
	printf("2.5+1/3=%.19f\n", 2.5+1.0/3);
	printf("2.5*3.3=%f 1-10=%d\n", 2.5*3.3, 1-10);
	/*
	1、四则运算符：+ - * /
	2、整数与整数计算为整数
	3、浮点数与整数或浮点数计算为浮点数 1/3=0 1.0/3=0.333333
	4、提升计算优先级使用括号()，括号包含不能使用数字里的[] {}仍然是括号，多重括号
	5、无括号提升计算优先级的情况下，与数字里的四则计算等级一致
	*/
	printf("((1+2)-(4-5))*6=%d\n",((1+2)-(4-5))*6);
	return 0;
}

/*练习题 ：
1、计算梯形上底15，下底25，面积为150，求高。
(15+2)
*/